In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
alldataset = pd.read_csv(r"D:\Github\Data-Science-And-Machine-Learning-Course\Datasets\Social_Network_Ads.csv")

In [3]:
alldataset.head(4)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0

In [8]:
dataset = alldataset.drop(columns=["User ID", "Gender", "EstimatedSalary"])
dataset

     Age  Purchased
0     19          0
1     35          0
2     26          0
3     27          0
4     19          0
..   ...        ...
395   46          1
396   51          1
397   50          1
398   36          0
399   49          1

[400 rows x 2 columns]